tests/performance/auth-performance-test.yml
config:
  target: "http://localhost:5000" 
  phases:
    - duration: 60
      arrivalRate: 10

headers:
  Authorization: "Bearer access_token_here"

scenarios:
  - name: "Register and Login"
    flow:
      - post:
          url: "/api/auth/register"
          json:
            memberId: "test123"
            username: "testuser"
            email: "test@example.com"
            password: "password123"
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "password123"

  - name: "Update User Profile"
    flow:
      - put:
          url: "/api/auth/update/profile"
          json:
            username: "updateduser"
            email: "updated@example.com"
            newPassword: "newpassword123"

  - name: "Get User Profile"
    flow:
      - get:
          url: "/api/auth/profile"

  - name: "Get All Users"
    flow:
      - get:
          url: "/api/auth/getusers"

  - name: "Get User by Member ID"
    flow:
      - get:
          url: "/api/auth/users/test123"

  - name: "Delete User by Member ID"
    flow:
      - delete:
          url: "/api/auth/users/test123"