tests/performance/notification-performance-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10

headers:
  Authorization: "Bearer access_token_here"

scenarios:
  - name: "Add Notification"
    flow:
      - post:
          url: "/api/notification/add"
          json:
            user: "IT56789"
            title: "Test Notification"
            text: "This is a test notification"

  - name: "Get Notifications"
    flow:
      - get:
          url: "/api/notification/get/IT56789"